# На вход программе подаются два натуральных числа n и m.
# Напишите программу, которая создает матрицу размером n×m, заполнив её в соответствии с образцом.

# Формат входных данных
# На вход программе на одной строке подаются два натуральных числа n и m — количество строк и столбцов в матрице.

# Формат выходных данных
# Программа должна вывести указанную матрицу в соответствии с образцом.

# Примечание. Для вывода элементов матрицы как в примерах отводите ровно 3 символа на каждый элемент.
# Для этого используйте строковый метод ljust(). Можно обойтись и без ljust(), система примет и такое решение 😇


n = int(input())
mat_1 = [[0]*n for _ in range(n)]

for i in range(n):
    for j in range(n):
        if i <= j and i <= n-1-j:
            mat_1[i][j] = 1
        elif i >= j and i >= n-j-1:
            mat_1[i][j] = 1

for row in range(n):
    for col in range(n):
        print(str(mat_1[row][col]).ljust(3), end='')
    print()