# Анаграмма – слово (словосочетание), образованное путём перестановки букв,
# составляющих другое слово (или словосочетание). Например, английские слова evil и live – это анаграммы.
#
# На вход программе подаются два слова. Напишите программу, которая определяет, являются ли они анаграммами.
#
# Формат входных данных
# На вход программе подаются два слова, каждое на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести YES если слова являются анаграммами и NO в противном случае.

ls1 = list(input())
ls2 = list(input())
ls1.sort()
ls2.sort()

if ls1 == ls2:
    print("YES")
else:
    print("NO")
